---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.GetValuesCount
source: html/21b2635c-7f4f-f8fd-262f-5a8377f08e12.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.GetValuesCount Method

Returns the number of values in the set.

## Syntax (C#)
```csharp
public int GetValuesCount()
```